{
  "pdfText": "\n\nNeeraj Kumar Kummari\nCONTACT DETAILS\nPhone:+91 93903 73794\nEmail:nanineeraj309@gmail.com\nGitHub:Neeraj3737\nLinkedIn:Kummari\nNeerajKumar\nLeetCode:KummariNeerajKumar\nPROFESSIONAL SUMMARY\nMotivated Computer Science undergraduate with a passion for crafting scalable software solutions and\nsolving real-world problems. Skilled in full-stack development with hands-on experience building dynamic\nweb applications using modern technologies like React, Node.js, and MySQL. Strong foundation in data\nstructures and algorithms, reinforced by practical project work and continuous problem-solving.  Known\nfor  quick  learning,  collaborative  spirit,  and  a  drive  to  contribute  meaningfully  to  innovative  software\nprojects.\nEDUCATION\nIndian Institute of Information Technology, Sri CityAug 2022 – May 2026\nBachelor of Technology in Computer Science and Engineering\nCGPA: 7.7 / 10\nRelevant Coursework:Data Structures and Algorithms, Operating Systems, OOP, DBMS, Computer\nNetworks, Artificial Intelligence, Computer Architecture\nEXPERIENCE & PROJECTS\nShelfX - Book Rental and Sales Platform(React.js, Tailwind CSS, Node.js, MySQL)\n•Developed a full-stack web application enabling users to rent and sell books online.\n•Built an admin dashboard to manage users, requests, and inventory in real-time.\n•Designed and implemented request workflows (accept/decline) for streamlined user interaction.\nDistributed File System(Python, Socket Programming)\n•Created a client-server file management system allowing users to upload, read, and delete files.\n•Implemented socket communication to handle concurrent requests securely and efficiently.\nHotel Management System(Java, OOP, CLI)\n•Designed and implemented a robust hotel management system in Java using object-oriented principles.\n•Features include dynamic room management, real-time booking and cancellation, check-in/check-out\ndate tracking, and room status monitoring (Available, Booked, Under Maintenance).\n•Developed an interactive command-line interface for seamless user interaction and efficient hotel op-\nerations.\nTECHNICAL PROFICIENCIES\nLanguages:C, Java, Python\nWeb Development:HTML5, CSS, JavaScript, React.js, Tailwind CSS\n1\n\nDatabases:SQL, MySQL\nTools & Frameworks:Git, Node.js, REST APIs, Socket Programming\nCore Concepts:Data Structures, Algorithms, OOP, Operating Systems, DBMS\n2",
  "history": []
}